#### Terraform Plan 📖

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cloudformation.aws_s3_bucket.sc_template_bucket will be created
  + resource "aws_s3_bucket" "sc_template_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "prakash-cloudformation-template"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.cloudformation.aws_s3_bucket_policy.sc_bucket_policy will be created
  + resource "aws_s3_bucket_policy" "sc_bucket_policy" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "s3:GetObject",
                          + "s3:GetObjectVersion",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "cloudformation.amazonaws.com"
                        }
                      + Resource  = "arn:aws:s3:::prakash-cloudformation-template/*"
                      + Sid       = "AllowCloudFormationReadAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.cloudformation.aws_s3_object.product_template will be created
  + resource "aws_s3_object" "product_template" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/yaml"
      + etag                   = "ef8ab7ae7431e50aba01be508ebaed74"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "product-template.yaml"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "modules/terraform-aws-s3-cloudformation/product-template.yaml"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.servicecatalog.aws_iam_role.sc_launch_role will be created
  + resource "aws_iam_role" "sc_launch_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "servicecatalog.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ServiceCatalogLaunchRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.servicecatalog.aws_iam_role_policy.sc_launch_policy will be created
  + resource "aws_iam_role_policy" "sc_launch_policy" {
      + id          = (known after apply)
      + name        = "ServiceCatalogLaunchPolicy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.servicecatalog.aws_servicecatalog_constraint.launch_role_constraint will be created
  + resource "aws_servicecatalog_constraint" "launch_role_constraint" {
      + accept_language = "en"
      + description     = (known after apply)
      + id              = (known after apply)
      + owner           = (known after apply)
      + parameters      = (known after apply)
      + portfolio_id    = (known after apply)
      + product_id      = (known after apply)
      + status          = (known after apply)
      + type            = "LAUNCH"
    }

  # module.servicecatalog.aws_servicecatalog_portfolio.portfolio will be created
  + resource "aws_servicecatalog_portfolio" "portfolio" {
      + arn           = (known after apply)
      + created_time  = (known after apply)
      + description   = "A test portfolio"
      + id            = (known after apply)
      + name          = "Prakash-My-hello-portfolio"
      + provider_name = "MyProvider"
      + tags_all      = (known after apply)
    }

  # module.servicecatalog.aws_servicecatalog_principal_portfolio_association.portfolio_principal will be creat...
```